* Temporary

** acm
*** DONE [#A] 做完最短路的一套题                                                :acm:
   CLOSED: [2018-03-03 Sat 00:01] DEADLINE: <2018-03-02 Fri> SCHEDULED: <2018-02-28 Wed 12:53>
   - State "DONE"       from "desolate"   [2018-03-04 Sun 12:38] \\
     越往后内容越困难了，比如最小环，比如和最大流相干，比如差分约束。
     剩了几个内容，就上面那几个+spfa。勉强算完成了吧，做的有些乏了，改下思路先开下一套题吧。
   - State "desolate"   from "TODO"       [2018-03-03 Sat 00:01] \\
     是我的错。我尽量明天弥补吧。
     今天实在是蠢。
   :LOGBOOK:  
   CLOCK: [2018-02-28 Wed 19:38]--[2018-02-28 Wed 21:54] =>  2:16 \\ 虽然中间走神啊，听歌啊还是不少，不过可以可以，做了一半了！！！！
   CLOCK: [2018-02-28 Wed 18:34]--[2018-02-28 Wed 19:35] =>  1:01
   CLOCK: [2018-02-28 Wed 14:07]--[2018-02-28 Wed 14:24] =>  0:17 \\
   做了一道，看了看以前的题。嗯没这个意识去开计时器，下次下次。
   :END:      
应该不难。这两天时间挺多的。大概10道多的样子。
*
*** DONE [#A] 做完并查集的一套题                                                :acm:
   CLOSED: [2018-03-20 Tue 20:41] SCHEDULED: <2018-03-04 Sun> DEADLINE: <2018-03-09 Fri>
   - State "DONE"       from "STARTED"    [2018-03-20 Tue 20:41]
   :LOGBOOK:  
   CLOCK: [2018-03-06 Tue 16:06]--[2018-03-06 Tue 18:21] =>  2:15
   :END:      
[2018-03-05 Mon 21:07] 写了四道，知道了大概的模样。。毕竟原来是开了题分辨出并查集却不会用的状态。
   
*** DONE 做完拓扑的一套题                                                       :acm:
    CLOSED: [2018-03-14 Wed 16:06] DEADLINE: <2018-03-14 Wed> SCHEDULED: <2018-03-13 Tue>
    - State "DONE"       from "STARTED"    [2018-03-14 Wed 16:06]
*** DONE 拉一套dp的题                                                           :acm:
    CLOSED: [2018-03-30 Fri 21:48] SCHEDULED: <2018-03-26 Mon> DEADLINE: <2018-03-28 Wed>
    - State "DONE"       from "TODO"       [2018-03-30 Fri 21:48]

*** desolate 做蓝桥杯题                                                         :acm:
    CLOSED: [2018-03-30 Fri 21:48] DEADLINE: <2018-03-30 Fri>
    - State "desolate"   from "TODO"       [2018-03-30 Fri 21:48]
*** desolate [#B] 做完线段树一套                                                :acm:
    CLOSED: [2018-04-25 Wed 10:22] DEADLINE: <2018-04-20 Fri> SCHEDULED: <2018-04-10 Tue>
    - State "desolate"   from "TODO"       [2018-04-25 Wed 10:22] \\
      完了。这一周真的是状态差
基本上就是生啃吧hhh
我放的时间很长了。不过没有下面树的专题来的急。
*** desolate [#A] 做完划分树、主席树、rmq、伸展树、树链剖分的专题...            :acm:
    CLOSED: [2018-04-25 Wed 10:22] DEADLINE: <2018-04-25 Wed> SCHEDULED: <2018-04-10 Tue>
    - State "desolate"   from "TODO"       [2018-04-25 Wed 10:22] \\
      只做了划分树和rmq，回去补树状数组了。
因为下周很可能是我讲。极大可能。
哦我去看了下，是25号。

*** desolate 做完bit的题                                                        :acm:
    CLOSED: [2018-05-23 Wed 14:51] SCHEDULED: <2018-04-25 Wed> DEADLINE: <2018-04-27 Fri>
    - State "desolate"   from "TODO"       [2018-05-23 Wed 14:51] \\
      QAQ荒废完全是我的锅

** 紧急事务
*** desolate 做天梯赛的提高题
    CLOSED: [2018-03-30 Fri 21:49] SCHEDULED: <2018-03-26 Mon> DEADLINE: <2018-03-28 Wed>
    - State "desolate"   from "TODO"       [2018-03-30 Fri 21:49]
*** DONE 开两套综合题，开搜索和dp[0/0]
    CLOSED: [2018-03-09 Fri 10:53] DEADLINE: <2018-03-09 Fri> SCHEDULED: <2018-03-07 Wed>
    - State "DONE"       from ""           [2018-03-09 Fri 10:53] \\
      凉了啊比赛，绝壁凉了    
**** 综合
**** 搜索
**** dp
*** DONE [#A] stitp立项--简介
    CLOSED: [2018-04-13 Fri 16:35] SCHEDULED: <2018-04-10 Tue> DEADLINE: <2018-04-11 Wed>
    - State "DONE"       from "TODO"       [2018-04-13 Fri 16:35]
虽然大部分是吴宇晨的活，但是尽量帮下吧。写简介。
** 日常事务
*** DONE 完成棣文给的那套东西。。[0/0]
   CLOSED: [2018-03-05 Mon 13:07] DEADLINE: <2018-03-05 Mon> SCHEDULED: <2018-03-03 Sat>
   - State "DONE"       from "TODO"       [2018-03-05 Mon 13:07] \\
     昨天上午弄完的，前天晚上写到半夜啦。这个也是有点脑残了。。忘记了

**** CANCELLED 设计基类
    CLOSED: [2018-03-27 Tue 21:19]
    - State "CANCELLED"  from "TODO"       [2018-03-27 Tue 21:19]
**** CANCELLED 派生向量
    CLOSED: [2018-03-27 Tue 21:19]
    - State "CANCELLED"  from "TODO"       [2018-03-27 Tue 21:19]
从基类通过public继承而派生的向量类模板
**** CANCELLED 派生字符串类
    CLOSED: [2018-03-27 Tue 21:19]
    - State "CANCELLED"  from "TODO"       [2018-03-27 Tue 21:19]
从基类通过public继承而派生的字符串模板。

*** DONE [#B] 准备好反思交给老板
   CLOSED: [2018-03-03 Sat 18:44] SCHEDULED: <2018-03-02 Fri>
   - State "DONE"       from "TODO"       [2018-03-03 Sat 18:44]
*** DONE [#A] 做好org-mode的gtd文件[2/2]
   CLOSED: [2018-02-28 Wed 12:58] DEADLINE: <2018-03-01 Thu> SCHEDULED: <2018-02-27 Tue 19:10>
   - State "DONE"       from "TODO"       [2018-02-28 Wed 12:58]
*** DONE org的学习
    CLOSED: [2018-02-27 Tue 19:18]
    - State "DONE"       from ""           [2018-02-27 Tue 19:18] \\
      虽然不完全，但是总要在实践中才能完善
*** DONE gtd文件的构建
    CLOSED: [2018-02-28 Wed 12:57]
    - State "DONE"       from "TODO"       [2018-02-28 Wed 12:57] \\
      大概算是可以了。具体美观啊，属性啊可以再议
目前的形态不够完善

*** [#A] 搞清楚比赛地址！
*** TODO 学习vim的配置和运用
    SCHEDULED: <2018-05-23 Wed>
** 学校事务
*** DONE 6级交钱
    CLOSED: [2018-03-19 Mon 00:04] SCHEDULED: <2018-03-16 Fri>
    - State "DONE"       from ""           [2018-03-19 Mon 00:04]
    
* Long-term
  所以什么叫长呢——我以为就是以学期为单位乃至无限期制的任务（笑）
** 学期内
*** TODO 学语言[0/3]
**** TODO 一门函数式语言
不知道lisp算不算（笑），haskell从大一上就关注到了，现在还没动手。
**** TODO 一门c规格外的语言
不过分吧。棣文要我学jsdom和php，
**** TODO 一门c规格内的语言
哪怕是python呢...java也行(−_−＃)
*** TODO [#B] 机器学习/密码学 择一而登堂入室
 | 机器学习 |
 | 密码学   |
**** 为此需要学习数学知识[0/3]
***** TODO [#C] 数论
***** TODO [#C] 代数
***** TODO [#C] 概率论
*** TODO 了解信息安全方面的知识


* daily
** 作业[0/3]                                                                    :school:
*** TODO 信息论                                                                 :school:
    SCHEDULED: <2018-03-06 Tue ++1w>
    - State "DONE"       from "TODO"       [2018-02-28 Wed 10:33] \\
      第一周似乎没有\(//∇//)\
    :PROPERTIES:
    :LAST_REPEAT: [2018-02-28 Wed 10:33]
    :END:
*** TODO 数电                                                                   :school:
    SCHEDULED: <2018-03-06 Tue ++1w>
    - State "DONE"       from "TODO"       [2018-02-28 Wed 21:55] \\
      (´･ω･`)
    :PROPERTIES:
    :LAST_REPEAT: [2018-02-28 Wed 21:55]
    :END:
*** TODO 数据结构                                                               :school:
    SCHEDULED: <2018-03-26 Mon ++1w>
    - State "DONE"       from "TODO"       [2018-03-19 Mon 00:05]
    - State "DONE"       from "TODO"       [2018-03-05 Mon 21:06] \\
      hhh，现场写完！
    - State "DONE"       from "TODO"       [2018-03-01 Thu 12:27] \\
      没有
    :PROPERTIES:
    :LAST_REPEAT: [2018-03-19 Mon 00:05]
    :END:

 
** 学习   
*** TODO 做题                                                                   :acm:
    SCHEDULED: <2018-03-04 Sun +1d>
    - State "DONE"       from "STARTED"    [2018-03-26 Mon 20:43]
    - State "DONE"       from "TODO"       [2018-03-04 Sun 12:44] \\
      虽然只写了两道，不过不大想动了
    - State "DONE"       from "STARTED"    [2018-03-04 Sun 01:34] \\
      嗯今天大概写了7个h吧。。应该还多(´･ω･`)
    - State "DONE"       from "STARTED"    [2018-02-28 Wed 21:56] \\
      3h+吧，做的题也就5道。emmm，好像就独立做了两道，还是和之前度娘过的题比较类似的(╯‵□′)╯︵┻。嘛就这样吧
    :LOGBOOK:  
    CLOCK: [2018-03-05 Mon 13:07]--[2018-03-05 Mon 19:19] =>  6:12 \\不真实！其实不过2h
    CLOCK: [2018-03-03 Sat 16:28]--[2018-03-03 Sat 21:40] =>  5:12 \\写不动了！
    :END:      
    :PROPERTIES:
    :LAST_REPEAT: [2018-03-26 Mon 20:43]
    :END:
至少一道啦。另外计时啦。
可以记下做题感受，不要水题(´▽｀)
*** 看书
嗯这个随意啦
*** 探索\(//∇//)\
    
** TODO 跑步                                                                    :daily:
   SCHEDULED: <2018-04-26 Thu ++1d>
   - State "DONE"       from "TODO"       [2018-04-25 Wed 10:18] \\
     昨天晚上跑了两圈。
   - State "DONE"       from "TODO"       [2018-04-10 Tue 16:36]
   - State "DONE"       from "TODO"       [2018-04-09 Mon 21:20]
   - State "TODO"       from "TODO"       [2018-03-04 Sun 01:35] \\
     唉周末就是这样子的。不知道下周开始早操是不是就彻底凉了。。
   - State "DONE"       from "TODO"       [2018-02-28 Wed 18:16] \\
     三圈！吃完饭还是有点不行。不大行不大行。主要是好累...好累...
   :PROPERTIES:
   :LAST_REPEAT: [2018-04-25 Wed 10:18]
   :END:
尽量坚持吧。
** 娱乐
   :LOGBOOK:  
   :END:      
直接在其中计时。
*** 看番
*** STARTED 打游戏
    :LOGBOOK:  
    CLOCK: [2018-03-04 Sun 12:45]--[2018-03-05 Mon 13:03] => 24:18\\。。。。。不想说话
    CLOCK: [2018-03-02 Fri 16:38]--[2018-02-28 Fri 21:45] \\ 其实没那么久...但是还是想不起啊..
    CLOCK: [2018-02-28 Wed 14:27]--[2018-02-28 Wed 16:20] =>  1:53 \\
    emmm，实际上比这个早一些就结束了但是忘了关clock...僵硬。
    :END:      

* 比赛
*** 天梯赛选拔
*** DONE 蓝桥杯
    CLOSED: [2018-04-01 Sun 15:57]
    - State "DONE"       from ""           [2018-04-01 Sun 15:57]
    //大概凉了
    //[2018-04-14 Sat]更新 居然进了决赛=。=
*** DONE 天梯赛
    CLOSED: [2018-03-31 Sat 15:57]
    - State "DONE"       from ""           [2018-03-31 Sat 15:57]
//181...离着1队差着30多分，加油吧
*** 校队选拔队伍（邀请赛名额）
*** wishare杯
凉的一批。不过题其实也毒性了一些，3题一等....当然还是有点太菜了....吴永琦7题好像？lyy和张松涛都是6题？
唯一欣慰的是hm1题=。=？
唉
*** DONE 湘潭赛区
    CLOSED: [2018-05-13 Sun 14:53]
    - State "DONE"       from ""           [2018-05-13 Sun 14:53] \\
      嗯，铜牌滚粗
*** DONE 西安赛区
    CLOSED: [2018-05-20 Sun 14:53]
    - State "DONE"       from ""           [2018-05-20 Sun 14:53] \\
      居然摸了银牌
